&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	СтудентФИО           = "Кононова Виктория Юрьевна";		
	ДатаРожденияСтудента = Дата("19841009000000");		
	ФИОПолностью         = СтудентФИО;
	ДатаРождения         = ДатаРожденияСтудента;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводИнформацииОСтуденте(Команда)
	
	СтудентФИО           = СокрЛП(ФИОПолностью);
	ДатаРожденияСтудента = ДатаРождения;
	
	Если ФИОВведеноПолностью(СтудентФИО) Тогда
	    ВозрастСтудента     = ОпределитьВозрастСтудента(ДатаРожденияСтудента);
	    ГодРожденияСтудента = Год(ДатаРожденияСтудента);
		СообщитьОСтуденте(СтудентФИО, ГодРожденияСтудента, ВозрастСтудента);
	Иначе
		Сообщить("Подсказка! Введите фамилию, имя и отчество полностью через пробел, например: ""Петров Петр Петрович"".")
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ФИОВведеноПолностью(СтудентФИО)
	
	РезультатПроверки = Истина;
	
	Если ПустаяСтрока(СтудентФИО) Тогда
		  Сообщить("Ошибка!!! Строка ФИО пустая!");
		  РезультатПроверки = Ложь;
	ИначеЕсли ПустаяСтрока(ВыделитьИмяИзПолногоФИО(СтудентФИО)) Тогда
		  Сообщить("Ошибка!!! В строке ФИО только фамилия!");
		  РезультатПроверки = Ложь;
	ИначеЕсли ПустаяСтрока(ВыделитьОтчествоИзПолногоФИО(СтудентФИО)) Тогда
	      Сообщить("Ошибка!!! В строке ФИО нет отчества!");
		  РезультатПроверки = Ложь;
	КонецЕсли;
	  
	Возврат РезультатПроверки;
	
КонецФункции

&НаКлиенте
Функция ВыделитьФамилиюИзПолногоФИО(СтудентФИО)
	
	НомерПозицииПервогоПробела = СтрНайти(СтудентФИО," ");
	
	Если НомерПозицииПервогоПробела > 0 Тогда
		Фамилия = Лев(СтудентФИО,(НомерПозицииПервогоПробела-1));
	Иначе 
		Фамилия = СтудентФИО;
	КонецЕсли;
	
	Возврат Фамилия;
	
КонецФункции

&НаКлиенте
Функция ВыделитьИмяИзПолногоФИО(СтудентФИО)
	
	Имя = "";
	
	НомерПозицииПервогоПробела = СтрНайти(СтудентФИО," ");
	Если НомерПозицииПервогоПробела > 0 Тогда
		ИОСтудента                 = СокрЛП(Сред(СтудентФИО,(НомерПозицииПервогоПробела+1),СтрДлина(СтудентФИО)));
		НомерПозицииВторогоПробела = СтрНайти(ИОСтудента," ");
		Если НомерПозицииВторогоПробела > 0  Тогда
			Имя = Лев(ИОСтудента, (НомерПозицииВторогоПробела-1) );
			Иначе Имя = ИОСтудента;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Имя;
	
КонецФункции

&НаКлиенте
Функция ВыделитьОтчествоИзПолногоФИО(СтудентФИО)
	
	Отчество = "";
	
	НомерПозицииПервогоПробела = СтрНайти(СтудентФИО," ");
	Если НомерПозицииПервогоПробела > 0 Тогда
		ИОСтудента                 = СокрЛП(Сред(СтудентФИО,(НомерПозицииПервогоПробела+1),СтрДлина(СтудентФИО)));
		НомерПозицииВторогоПробела = СтрНайти(ИОСтудента," ");
		Если НомерПозицииВторогоПробела > 0  Тогда
			Отчество = СокрЛП(Сред(ИОСтудента, (НомерПозицииВторогоПробела+1), СтрДлина(ИОСтудента)));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отчество;
	
КонецФункции
                                                                    
&НаКлиенте
Функция ОпределитьВозрастСтудента(ДатаРожденияСтудента)
	//В коде ниже определяется количество полных лет студента на текущую дату
	ВозрастСтудента = Год(ТекущаяДата())   - Год(ДатаРожденияСтудента);
	РазницаВМесяцах = Месяц(ТекущаяДата()) - Месяц(ДатаРожденияСтудента);
	
	Если РазницаВМесяцах < 0      Тогда  
		ВозрастСтудента = ВозрастСтудента - 1;
	ИначеЕсли РазницаВМесяцах = 0 Тогда
		ВозрастСтудента = СкорректироватьПоРазницеВДнях(ВозрастСтудента, ДатаРожденияСтудента);
	КонецЕсли;
	
	Возврат ВозрастСтудента;
	
КонецФункции

&НаКлиенте
Функция СкорректироватьПоРазницеВДнях(ВозрастСтудента, ДатаРожденияСтудента)
	
	Если (День(ТекущаяДата()) - День(ДатаРожденияСтудента)) < 0 Тогда
		ВозрастСтудента = ВозрастСтудента - 1;
	КонецЕсли;
	Возврат ВозрастСтудента;  
	
КонецФункции

&НаКлиенте
Процедура СообщитьОСтуденте(СтудентФИО, ГодРождения, ВозрастСтудента)
	
	//В коде ниже выводится строка в следующем формате : "Студент Петров П.П. 1980 г.р. 42 года"
	ФамилияСтудента         = ВыделитьФамилиюИзПолногоФИО(СтудентФИО);
	ИмяСтудента             = ВыделитьИмяИзПолногоФИО(СтудентФИО);
    ОтчествоСтудента        = ВыделитьОтчествоИзПолногоФИО(СтудентФИО);
	ИнициалИмениСтудента    = Лев(ИмяСтудента,1);
	ИнициалОтчестваСтудента = Лев(ОтчествоСтудента,1);
	
	
	Сообщить("Студент "+ФамилияСтудента+" "
	+ИнициалИмениСтудента+"."
	+ИнициалОтчестваСтудента+". "
	+Строка(Формат(ГодРождения,"ЧГ=0"))+" г.р. "
	+Строка(ВозрастСтудента)+" лет(года)");
				
КонецПроцедуры



