&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Делимое  = 5;
	Делитель = 0;
	Число    = -25;
	Строка   = "Привет мир!"
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьЧастноеЛовитьИсключение(Команда)
	
   Попытка
   	Результат = Делимое/Делитель;
	Сообщить("Частное = " + Результат + ".");
   Исключение
    Инфо = ИнформацияОбОшибке();
    Сообщить("Описание='" + Инфо.Описание + "'");
    Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
    Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
    Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
   КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьЧастное(Команда)
	Результат = Делимое/Делитель;
	Сообщить("Частное = " + Результат + ".");
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьКореньЛовитьИсключение(Команда)
	
   Попытка
   	Результат = Sqrt(Число);
	Сообщить("Корень = " + Результат + ".");
   Исключение
    Инфо = ИнформацияОбОшибке();
    Сообщить("Описание='" + Инфо.Описание + "'");
    Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
    Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
    Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
   КонецПопытки;

КонецПроцедуры 

&НаКлиенте
Процедура ВычислитьКорень(Команда)
	Результат = Sqrt(Число);
	Сообщить("Корень = " + Результат + ".");	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьКТипуЧисло(Команда)

   	Результат = Число(Строка);
	Сообщить("Строка преобразована в Число = " + Результат + ".");
	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьКТипуЧислоЛовитьИсключение(Команда)
	
   Попытка
   	Результат = Число(Строка);
	Сообщить("Строка преобразована в Число = " + Результат + ".");
   Исключение
    Инфо = ИнформацияОбОшибке();
    Сообщить("Описание='" + Инфо.Описание + "'");
    Сообщить("ИмяМодуля='" + Инфо.ИмяМодуля + "'");
    Сообщить("НомерСтроки=" + Инфо.НомерСтроки);
    Сообщить("ИсходнаяСтрока='" + Инфо.ИсходнаяСтрока + "'");
   КонецПопытки;

КонецПроцедуры










