&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВведитеСтроку = "Виктория";
	ВведитеЧисло = 37;
	ВведитеДату = Дата("19841009000000");
	ПоставьтеГалочку = Истина;
	НеСтавьтеГалочку = Ложь;
	ЗдесьNULL = NULL;
	ЗдесьНеопределено = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьТипДанных(Команда)

	Параметр1 = ВведитеСтроку;
	Параметр2 = ВведитеЧисло;
	Параметр3 = ВведитеДату;
	Параметр4 = ПоставьтеГалочку;
	Параметр5 = НеСтавьтеГалочку;
	Параметр6 = ЗдесьNULL;
	Параметр7 = ЗдесьНеопределено;
	
	СообщитьТипПараметра(Параметр1, 1);
	СообщитьТипПараметра(Параметр2, 2);
	СообщитьТипПараметра(Параметр3, 3);
	СообщитьТипПараметра(Параметр4, 4); 
	СообщитьТипПараметра(Параметр5, 5);
	СообщитьТипПараметра(Параметр6, 6);
	СообщитьТипПараметра(Параметр7, 7);
	
КонецПроцедуры 

&НаКлиенте
Процедура СообщитьТипПараметра(Параметр, Номер)
	
	Если Строка(ТипЗнч(Параметр)) = "Булево" Тогда
		Сообщить("Параметр" + Номер + " """ + Формат(Параметр, "БЛ=Ложь; БИ=Истина") + """"  + " - данный параметр имеет тип """ + Строка(ТипЗнч(Параметр)) + """. Этот параметр может принимать только два значения: либо ""Истина"", либо ""Ложь"".");
	Иначе
		Сообщить("Параметр" + Номер + " """ + Формат(Параметр, "БЛ=Ложь; БИ=Истина") + """"  + " - данный параметр имеет тип """ + Строка(ТипЗнч(Параметр)) + """.");
	КонецЕсли;
	
КонецПроцедуры



